import UIKit

/*
 Strings and integers
 ทำไม Swift เป็นภาษาปลอดภัยในเรื่องประเภทของข้อมูล?
 Swift ช่วยให้เราสร้างตัวแปรเป็นสตริงและจำนวนเต็ม แต่ยังสามารถสร้างประเภทของข้อมูลอื่นๆ ได้อีกด้วย ตอนสร้างตัวแปร Swift จะรู้ความหมายของประเภทตัวแปรตามประเภทของข้อมูลที่คุณกำหนดให้ และตั้งแต่นั้นไปตัวแปรนั้นจะมีประเภทเดียวกันตลอดเวลา

 ตัวอย่างเช่น การสร้างตัวแปรใหม่ชื่อ meaningOfLife และกำหนดให้มีค่าเท่ากับ 42:
 
 var meaningOfLife = 42
 
 var meaningOfLife = 42
 เนื่องจากเรากำหนดค่าเริ่มต้นของ meaningOfLife เป็น 42 จึงทำให้ Swift กำหนดประเภทของตัวแปรเป็นจำนวนเต็ม (integer) ซึ่งเป็นตัวแปรแบบ可เปลี่ยนค่าได้ ซึ่งหมายความว่าเราสามารถเปลี่ยนค่าของตัวแปรได้ตามที่เราต้องการ แต่เราไม่สามารถเปลี่ยนประเภทของตัวแปรได้: มันจะเป็นจำนวนเต็มตลอดเวลา

 นี่เป็นสิ่งที่มีประโยชน์อย่างมากเมื่อสร้างแอปพลิเคชัน เพราะมันหมายความว่า Swift จะตรวจสอบและตรวจพบข้อผิดพลาดของข้อมูลที่เราเขียนไม่ได้ เช่น เราไม่สามารถเขียนแบบนี้ได้:

 meaningOfLife = "Forty two"

 ซึ่งพยายามกำหนดสตริงให้กับตัวแปรที่เป็นจำนวนเต็ม ซึ่งไม่ได้รับอนุญาตให้ทำ แม้ว่าเราจะไม่ได้ทำผิดพลาดอย่างนี้บ่อย แต่คุณจะพบว่าประโยชน์ของการประกันความปลอดภัยในเรื่องประเภทของข้อมูลนี้จะช่วยได้ทุกวันที่คุณเขียนโค้ดด้วย Swift
 
 ข้อ 1/6: โค้ดไหนสร้างตัวแปรเป็นจำนวนเต็ม (integer) ?

 คำแนะนำ: Swift จะกำหนดประเภทของตัวแปรเป็น string เมื่อค่าของตัวแปรนั้นถูกครอบคลุมด้วยเครื่องหมายคำพูด (quote) ไม่ว่าค่าจะเป็นอะไรก็ตาม
 
 Option 1:
 var mortgageRemaining = 100_000
 
 Option 2:
 var dogBreed = "samoyed"
 
 */
