import UIKit


/*
  
 การใช้ลูปแบบ while
 ใช้เงื่อนไขเป็นตัวกำหนดขอบเขตหรือจุดสิ้นสุดการวนลูป
 ไม่ใช้ช่วงตัวเลขเหมือนกับ for-in
 
 while เงื่อนไข {
 }
 
 หลักการของลูป while คือ ถ้าเงื่อนไขยังตรงกับที่กำหนด จะวนไปเรื่อยๆ จน
 กว่าเงือนไขจะไม่ตรงจึงจะสิ้นสุดลูป
 
 var n = 1
while (n * n) < 100 {
    n += 1
}
print("n = \(n)")
 
 */


var n = 1234
var r = 0
var a = ""
print("ตัวเลขก่อนการจัดเรียง:", n)

while n > 0 {
    r = n % 10 // 1234 % 10 = 4 เอาเฉพาะเศษ
    n /= 10 // 1234/10 = 123 ตัวทำรอบ
    a = "\(a)\(r)" // ค่าในแต่ละลูปจะเป็น 4 => 43 => 432 => 4321
}

print("ตัวเลขหลังการเรียงย้อนกลับ:", a)


