import UIKit


/*
  
  การวางลูปซ้อนกัน
 
   - สามารถใช้ลูปซ้อนกันกี่ชั้นก็ได้
 
 for/while/repeat
    ...
    for/while/repeat
    ...
     for/while/repeat
     ...
    } ...
  } ...
 } ...
 
 เป็นการสร้างสามเหลียม โดยใช้ลูป for ซ้อนกัน 2 อัน ซึ้งลูป for ชั้นนอก (i) ใช้ในการเลื่อนไปยัง
 แถวถัดไป ส่วนลูปชั้นใน j ใช้แสดงตัวเลขในแต่ละแถวตั้งแต่ 1 จนถึงลำดับของแถวนั้น
 
 */

 var str = ""
for i in 1...5 { // ลูป i ใช้นับจำนวนแถว (แนวตั้ง)
    str = ""
    for j in 1...i { // ลูป j ใช้ในการแสดงตัวเลขในแต่ละแถวจาก 1 ถึง i
        str += String(j) + " "
    }
    print(str)
}
 
