import UIKit


/*
  
 ชนิดข้อมูล Type Inference
  - ไม่ระบุชนิดข้อมูล แต่ กำหนดค่าอย่างใดอย่างหนึ่งให้เลย ในขั้นตอนการประกาศทันที
   แล้วตัวแปรจะเป็นชนิดเดียวกับค่านั้น โดยอัตโนมัติ
 
  - หลังจากกำหนดค่าให้กับตัวแปรในครั้งแรก ตัวแปรก็จะมีชนิดข้อมูลตามค่านั้นไปเลย
    แล้วเราจะเปลียนไปกำหนดค่าเป็นชนิดอื่นไม่ได้
    var x = 3.14
    x = "Hello" // Error
 
 */

var x = 3.14
print(type(of: x))

var y = "Hello"
print(type(of: y))

let z = true
print(type(of: z))

//var a
//a = 123// Error ต้องกำหนดค่าในขั้นตอนการประกาศตัวแปร
