import UIKit


/*
  
  การแยกตัวเลขอกมาทีละตัว เช่น 2018 ก็จะแยกออกมาเป็น 2, 0, 1, 8 เป็นต้น
 
  - แยกเลข 123 ให้นำ 10 ไปหารแบบเอาเฉพาะเศษ จะได้เลขตัวสุดท้ายมา
 
  var x = 123
  var a = x % 10 // 123 % 3 = 3
 
  - หาจำนวนที่เหลือจาก x = 12
  x /= 10 = 12
 
  - นำเลข 12 ย้อนกลับไป % เอาเศษ จะได้เลขตัวท้ายมา
  a = x % 10 // 12 % 10 = 2
 
 */


 var n = 1009
 var remain = n
 var d = 0
 var str = ""
 

repeat {
    
  d = remain % 10
    if (str != "") {
        str = "\(d), \(str)"
    } else {
        str = "\(d)"
    }
    
    remain /= 10
    
} while (remain > 0)

print("ตัวเลขที่กำหนดคือ \(n)")
print("ตัวเลขที่แยกได้คือ \(str)")
